; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v6 ?v8)
             (pred_5 ?v4 ?v5)
             (pred_10 ?v6 ?v5)
             (pred_3 ?v1 ?v6 )
	     (pred_1 ?v6)
             (pred_12 ?v10)
             (pred_6 ?v4)
             (pred_8 ?v5)
             (pred_9 ?v6)
             (pred_7 ?v4)
             (pred_2 ?v6)
             (pred_11 ))



(:action op_3
:parameters (?v9 ?v7 ?v12 ?v13)
:precondition (and (pred_12 ?v9) (pred_12 ?v7) (pred_6 ?v12) (pred_8 ?v13)
          (pred_4 ?v9 ?v7) (pred_5 ?v12 ?v13)
                   (pred_10 ?v7 ?v13) (pred_1 ?v9) 
                   (pred_9 ?v7) (pred_7 ?v12))
:effect (and  (pred_2 ?v7) (not (pred_9 ?v7))))


(:action op_5
:parameters (?v9 ?v11)
:precondition (and (pred_12 ?v9) (pred_12 ?v11)
               (pred_1 ?v9) (pred_4 ?v9 ?v11) (pred_2 ?v11))
:effect (and (pred_1 ?v11) (not (pred_1 ?v9))))

(:action op_4
:parameters (?v9 ?v12)
:precondition (and (pred_12 ?v9) (pred_6 ?v12) 
                  (pred_1 ?v9) (pred_3 ?v12 ?v9) (pred_11 ))
:effect (and (pred_7 ?v12)
   (not (pred_3 ?v12 ?v9)) (not (pred_11 ))))


(:action op_1
:parameters (?v9 ?v2 ?v3)
:precondition (and (pred_12 ?v9) (pred_6 ?v2) (pred_6 ?v3)
                  (pred_1 ?v9) (pred_7 ?v3) (pred_3 ?v2 ?v9))
:effect (and (pred_7 ?v2) (pred_3 ?v3 ?v9)
        (not (pred_7 ?v3)) (not (pred_3 ?v2 ?v9))))

(:action op_2
:parameters (?v9 ?v12)
:precondition (and (pred_12 ?v9) (pred_6 ?v12) 
                  (pred_1 ?v9) (pred_7 ?v12))
:effect (and (pred_11 ) (pred_3 ?v12 ?v9) (not (pred_7 ?v12)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_03 obj_20 obj_09 obj_14 obj_06 obj_10 obj_15 obj_08 obj_12 obj_05 obj_18 obj_04 obj_07 obj_13 obj_01
    obj_19 obj_17 obj_11
    obj_22 obj_02 obj_16
    )

    (:init
       (pred_11)

       (pred_12 obj_21)
       (pred_12 obj_03)
       (pred_12 obj_20)
       (pred_12 obj_09)
       (pred_12 obj_14)
       (pred_12 obj_06)
       (pred_12 obj_10)
       (pred_12 obj_15)
       (pred_12 obj_08)
       (pred_12 obj_12)
       (pred_12 obj_05)
       (pred_12 obj_18)
       (pred_12 obj_04)
       (pred_12 obj_07)
       (pred_12 obj_13)
       (pred_12 obj_01)
       (pred_8 obj_19)
       (pred_8 obj_17)
       (pred_8 obj_11)
       (pred_6 obj_22)
       (pred_6 obj_02)
       (pred_6 obj_16)

       (pred_4 obj_21 obj_14)
       (pred_4 obj_21 obj_03)
       (pred_4 obj_03 obj_06)
       (pred_4 obj_03 obj_20)
       (pred_4 obj_03 obj_21)
       (pred_4 obj_20 obj_10)
       (pred_4 obj_20 obj_09)
       (pred_4 obj_20 obj_03)
       (pred_4 obj_09 obj_15)
       (pred_4 obj_09 obj_20)
       (pred_4 obj_14 obj_08)
       (pred_4 obj_14 obj_06)
       (pred_4 obj_14 obj_21)
       (pred_4 obj_06 obj_12)
       (pred_4 obj_06 obj_10)
       (pred_4 obj_06 obj_03)
       (pred_4 obj_06 obj_14)
       (pred_4 obj_10 obj_05)
       (pred_4 obj_10 obj_15)
       (pred_4 obj_10 obj_20)
       (pred_4 obj_10 obj_06)
       (pred_4 obj_15 obj_18)
       (pred_4 obj_15 obj_09)
       (pred_4 obj_15 obj_10)
       (pred_4 obj_08 obj_04)
       (pred_4 obj_08 obj_12)
       (pred_4 obj_08 obj_14)
       (pred_4 obj_12 obj_07)
       (pred_4 obj_12 obj_05)
       (pred_4 obj_12 obj_06)
       (pred_4 obj_12 obj_08)
       (pred_4 obj_05 obj_13)
       (pred_4 obj_05 obj_18)
       (pred_4 obj_05 obj_10)
       (pred_4 obj_05 obj_12)
       (pred_4 obj_18 obj_01)
       (pred_4 obj_18 obj_15)
       (pred_4 obj_18 obj_05)
       (pred_4 obj_04 obj_07)
       (pred_4 obj_04 obj_08)
       (pred_4 obj_07 obj_13)
       (pred_4 obj_07 obj_12)
       (pred_4 obj_07 obj_04)
       (pred_4 obj_13 obj_01)
       (pred_4 obj_13 obj_05)
       (pred_4 obj_13 obj_07)
       (pred_4 obj_01 obj_18)
       (pred_4 obj_01 obj_13)
       (pred_9 obj_09)
       (pred_9 obj_13)
       (pred_9 obj_20)
       (pred_10  obj_09 obj_19)
       (pred_10  obj_13 obj_17)
       (pred_10  obj_20 obj_11)
       (pred_2 obj_21)
       (pred_2 obj_03)
       (pred_2 obj_14)
       (pred_2 obj_06)
       (pred_2 obj_10)
       (pred_2 obj_15)
       (pred_2 obj_08)
       (pred_2 obj_12)
       (pred_2 obj_05)
       (pred_2 obj_18)
       (pred_2 obj_04)
       (pred_2 obj_07)
       (pred_2 obj_01)

       (pred_5  obj_22 obj_19)
       (pred_5  obj_02 obj_17)
       (pred_5  obj_16 obj_11)
       (pred_3 obj_22 obj_12)
       (pred_3 obj_02 obj_20)
       (pred_3 obj_16 obj_08)
       (pred_1 obj_18)
    )

    (:goal (and
       (pred_3 obj_22 obj_07)
       (pred_3 obj_16 obj_04)
    ))
(:constraints
  (always (not (pred_1 obj_05)))
)
)

; plan
1. (op_5 obj_18 obj_15)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_15)
   goals met: 0 of 2
2. (op_5 obj_15 obj_10)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_10)
   goals met: 0 of 2
3. (op_5 obj_10 obj_06)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_06)
   goals met: 0 of 2
4. (op_5 obj_06 obj_12)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_12)
   goals met: 0 of 2
5. (op_4 obj_12 obj_22)
   deleted: (pred_3 obj_22 obj_12) (pred_11)
   added: (pred_7 obj_22)
   goals met: 0 of 2
6. (op_5 obj_12 obj_08)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_08)
   goals met: 0 of 2
7. (op_1 obj_08 obj_16 obj_22)
   deleted: (pred_7 obj_22) (pred_3 obj_16 obj_08)
   added: (pred_7 obj_16) (pred_3 obj_22 obj_08)
   goals met: 0 of 2
8. (op_5 obj_08 obj_04)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_04)
   goals met: 0 of 2
9. (op_2 obj_04 obj_16)
   deleted: (pred_7 obj_16)
   added: (pred_11) (pred_3 obj_16 obj_04)
   goals met: 1 of 2
10. (op_5 obj_04 obj_08)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_08)
   goals met: 1 of 2
11. (op_4 obj_08 obj_22)
   deleted: (pred_3 obj_22 obj_08) (pred_11)
   added: (pred_7 obj_22)
   goals met: 1 of 2
12. (op_5 obj_08 obj_12)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_12)
   goals met: 1 of 2
13. (op_5 obj_12 obj_07)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_07)
   goals met: 1 of 2
14. (op_2 obj_07 obj_22)
   deleted: (pred_7 obj_22)
   added: (pred_11) (pred_3 obj_22 obj_07)
   goals met: 2 of 2
